
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 5 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_api_management_api_diagnostic.api_mgmt_logs
  * module.pre-api-mgmt-api-policy[0].azurerm_api_management_api_policy.api_policy
  * module.pre_api[0].azurerm_api_management_api.api
  * module.pre_api[0].azurerm_api_management_product_api.link_to_product[0]
* Update
  * module.apim_subscription_editvm[0].azurerm_api_management_subscription.subscription
  * module.apim_subscription_portal[0].azurerm_api_management_subscription.subscription
  * module.apim_subscription_powerplatform[0].azurerm_api_management_subscription.subscription
  * module.apim_subscription_smoketest[0].azurerm_api_management_subscription.subscription
  * module.pre-api-exception-alert[0].azurerm_resource_group_template_deployment.custom_alert[0]
* Delete
  * module.pre_api_b2c[0].azurerm_api_management_api.api


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_api_diagnostic.api_mgmt_logs will be created
  + resource "azurerm_api_management_api_diagnostic" "api_mgmt_logs" {
      + always_log_errors         = true
      + api_management_logger_id  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/loggers/sds-api-mgmt-stg-logger"
      + api_management_name       = "sds-api-mgmt-stg"
      + api_name                  = "pre-api"
      + http_correlation_protocol = "W3C"
      + id                        = (known after apply)
      + identifier                = "applicationinsights"
      + log_client_ip             = true
      + operation_name_format     = "Name"
      + resource_group_name       = "ss-stg-network-rg"
      + sampling_percentage       = 100
      + verbosity                 = "verbose"

      + backend_request {
          + body_bytes     = 8192
          + headers_to_log = [
              + "X-User-Id",
              + "accept",
              + "content-type",
              + "origin",
            ]
        }

      + backend_response {
          + body_bytes     = 8192
          + headers_to_log = [
              + "accept",
              + "content-type",
              + "origin",
            ]
        }

      + frontend_request {
          + body_bytes     = 8192
          + headers_to_log = [
              + "X-User-Id",
              + "accept",
              + "content-type",
              + "origin",
            ]
        }

      + frontend_response {
          + body_bytes     = 8192
          + headers_to_log = [
              + "accept",
              + "content-type",
              + "origin",
            ]
        }
    }

  # module.apim_subscription_editvm[0].azurerm_api_management_subscription.subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/8265f455-2bf2-4c4b-8ba3-bfd0a2f5a6b7"
        # (10 unchanged attributes hidden)
    }

  # module.apim_subscription_portal[0].azurerm_api_management_subscription.subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/500e642d-76ef-4d82-8741-bf9e9d979705"
        # (10 unchanged attributes hidden)
    }

  # module.apim_subscription_powerplatform[0].azurerm_api_management_subscription.subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/37f73c17-345b-4c67-81d5-50d582e97227"
        # (10 unchanged attributes hidden)
    }

  # module.apim_subscription_smoketest[0].azurerm_api_management_subscription.subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/da1d82f9-7187-4cb6-a6dd-b0020311f3bb"
        # (10 unchanged attributes hidden)
    }

  # module.pre-api-exception-alert[0].azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Resources/deployments/PRE_API_exception"
        name                     = "PRE_API_exception"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.pre-api-mgmt-api-policy[0].azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pre-api"
      + id                  = (known after apply)
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service base-url="https://pre-api.staging.platform.hmcts.net" />
                    <cors allow-credentials="false">
                        <allowed-origins>
                            <origin>*</origin>
                        </allowed-origins>
                        <allowed-methods>
                            <method>*</method>
                        </allowed-methods>
                        <allowed-headers>
                            <header>*</header>
                        </allowed-headers>
                    </cors>
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.pre_api[0].azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "sds-api-mgmt-stg"
      + api_type              = "http"
      + display_name          = "Pre Recorded Evidence API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "pre-api"
      + path                  = "pre-api"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "ss-stg-network-rg"
      + revision              = "118"
      + service_url           = "https://pre-api.staging.platform.hmcts.net"
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi+json-link"
          + content_value  = "https://raw.githubusercontent.com/hmcts/cnp-api-docs/master/docs/specs/pre-api.json"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.pre_api[0].azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pre-api"
      + id                  = (known after apply)
      + product_id          = "pre-api"
      + resource_group_name = "ss-stg-network-rg"
    }

  # module.pre_api_b2c[0].azurerm_api_management_api.api will be destroyed
  # (because azurerm_api_management_api.api is not in configuration)
  - resource "azurerm_api_management_api" "api" {
      - api_management_name   = "sds-api-mgmt-stg" -> null
      - api_type              = "http" -> null
      - display_name          = "Pre Recorded Evidence API B2C" -> null
      - id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/pre-api-b2c;rev=119" -> null
      - is_current            = true -> null
      - is_online             = false -> null
      - name                  = "pre-api-b2c" -> null
      - path                  = "pre-api-b2c" -> null
      - protocols             = [
          - "http",
          - "https",
        ] -> null
      - resource_group_name   = "ss-stg-network-rg" -> null
      - revision              = "119" -> null
      - service_url           = "https://pre-api.staging.platform.hmcts.net" -> null
      - subscription_required = false -> null
        # (6 unchanged attributes hidden)

      - import {
          - content_format = "openapi+json-link" -> null
          - content_value  = "https://raw.githubusercontent.com/hmcts/cnp-api-docs/master/docs/specs/pre-api-b2c.json" -> null
        }

      - subscription_key_parameter_names {
          - header = "Ocp-Apim-Subscription-Key" -> null
          - query  = "subscription-key" -> null
        }
    }

Plan: 4 to add, 5 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1192,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->